[
    {
        "_id": 1,
        "image": "https://i.ibb.co.com/mtbcZWV/Screenshot-2025-01-04-182527.png",
        "heading": "Service Orbit",
        "paragraph": "Service Orbit is a service-sharing web application designed to connect service providers with potential customers. The platform facilitates seamless interactions and transactions, empowering users to discover, offer, and engage with services efficiently.",
        "tools": [
            {
                "name": "React"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "Firebase"
            },
            {
                "name": "Node.js"
            },
            {
                "name": "MongoDB"
            },
            {
                "name": "Javascript"
            }
        ],
        "live": "https://service-orbit.web.app",
        "github": "https://github.com/tariqul420"
    },
    {
        "_id": 2,
        "image": "https://i.ibb.co.com/1TN6DcX/Screenshot-2025-01-04-185022.png",
        "heading": "Tariqul Islam",
        "paragraph": "Hello! I'm Tariqul Islam, a passionate and dedicated Front-end developer with a knack for creating visually appealing, responsive, and dynamic web applications. With expertise in modern front-end technologies like React, Tailwind CSS, and DaisyUI & others UI components, I strive to deliver seamless user experiences. On the backend, I leverage Node.js and MongoDB to build robust and scalable applications. Currently, I’m pursuing my studies while honing my skills to stay ahead in the ever-evolving tech landscape. Whether it's developing innovative platforms like Service Orbit or crafting sleek designs for Film Fusion, I thrive on solving challenges and turning ideas into reality. Let’s collaborate to bring your vision to life!",
        "tools": [
            {
                "name": "Javascript"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "React"
            }
        ],
        "live": "https://tariqul.vercel.app",
        "github": "https://github.com/tariqul420/tariqul-portfolio-react.git"
    },
    {
        "_id": 3,
        "image": "https://i.ibb.co.com/0CfRK1h/Screenshot-2025-01-04-183255.png",
        "heading": "Film Fusion",
        "paragraph": "Film Fusion is an interactive and feature-rich platform designed to cater to movie enthusiasts. It serves as a centralized hub for exploring, reviewing, and managing information about films and series. The platform is built with modern web technologies, ensuring a seamless user experience and aesthetic appeal.",
        "tools": [
            {
                "name": "React"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "Firebase"
            },
            {
                "name": "MongoDB"
            },
            {
                "name": "Javascript"
            },
            {
                "name": "Node.js"
            }
        ],
        "live": "https://kcode-generation.vercel.app",
        "github": "https://github.com/tariqul420"
    },
    {
        "_id": 4,
        "image": "https://i.ibb.co.com/8YFxg0J/Screenshot-2025-01-04-190413.png",
        "heading": "GreenQuest Adventures",
        "paragraph": "GreenQuest Adventures is an eco-friendly exploration platform where users embark on thrilling adventures, discovering sustainable practices, nature conservation, and eco-friendly initiatives to protect our planet for future generations.",
        "tools": [
            {
                "name": "React"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "Javascript"
            },
            {
                "name": "Firebase"
            }
        ],
        "live": "https://greenquest-adventures.web.app",
        "github": "https://github.com/programming-hero-web-course1/b10-a9-authentication-tariqul420.git"
    },
    {
        "_id": 5,
        "image": "https://i.ibb.co.com/pyvSFX6/Screenshot-2025-01-04-194706.png",
        "heading": "Quiz Website",
        "paragraph": "BistroBoss is a modern dining experience that blends gourmet flavors with a casual, welcoming atmosphere. Located in the heart of the city, we offer a wide array of freshly prepared dishes, from hearty comfort food to exquisite fine dining options. Our menu features locally sourced ingredients, and each dish is crafted with passion by our expert chefs to ensure the highest quality and taste. Whether you're here for a quick lunch, a romantic dinner, or a special celebration, BistroBoss promises a memorable dining experience. Enjoy our carefully curated selection of wines, craft cocktails, and desserts that complement every meal. At BistroBoss, we don't just serve food – we serve unforgettable moments.",
        "tools": [
            {
                "name": "React"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "TailwindCSS"
            },
            {
                "name": "Javascript"
            },
            {
                "name": "Firebase"
            },
            {
                "name": "MongoDB"
            },
            {
                "name": "Node.js"
            },
            {
                "name": "Express.js"
            }
        ],
        "live": "https://bistro-boss-restaurant-5.web.app",
        "github": "https://github.com/tariqul420/Bistro-Boss-Restaurant.git"
    },
    {
        "_id": 6,
        "image": "https://i.ibb.co.com/LkcRQdf/weather-apps.png",
        "heading": "Weather Checked",
        "paragraph": "The Weather Checker application provides users with real-time weather updates, making it easy to plan their day, whether at home, work, or while traveling. With a sleek and intuitive interface, you can easily check the current weather, forecast, and other key meteorological details, including temperature, humidity, wind speed, and precipitation. The app leverages reliable data from weather APIs to deliver accurate information for cities around the world.",
        "tools": [
            {
                "name": "HTML"
            },
            {
                "name": "Javascript"
            },
            {
                "name": "CSS"
            }
        ],
        "live": "https://tariqul420.github.io/WEATHER-APPS",
        "github": "https://github.com/tariqul420/WEATHER-APPS.git"
    }
]